/*  Напишите программу, которая на вход
 принимает два числа и проверяет, является
ли первое число квадратом второго.*/

// Console.Write("Введите первое число: ");
// int firstDigit = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите второе число: ");
// int secondDigit = Convert.ToInt32(Console.ReadLine());

// // firstDigit == secondDigit * secondDigit

// if (firstDigit == secondDigit * secondDigit)
// {
//     Console.WriteLine("Число " + firstDigit + " является квадратом от числа " + secondDigit);
// }
// else
// {
//     Console.WriteLine("Число " + firstDigit + " НЕ является квадратом от числа " + secondDigit);  
// }



/*Напишите программу, которая на вход 
принимает одно число (N), а на выходе 
показывает все целые числа в промежутке от -N до N.*/

// Console.Write("Введите число: ");

// int N = Convert.ToInt32(Console.ReadLine());
// if (N < 0)
// {
//     N = N * -1;
// }
// int negtiveN = N * -1;

// while (negtiveN <= N)
// {
//     Console.Write(negtiveN + " ");
//     negtiveN++;
// }